test/resources/ie4n05-v1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <S:Header>
    <To xmlns="http://www.w3.org/2005/08/addressing">partner:CCN2.Partner.BE.Customs.TAXUD/ICS_NES</To>
    <Action xmlns="http://www.w3.org/2005/08/addressing" S:mustUnderstand="true">CCN2.Service.Customs.EU.ICS.NESControlBAS/IE4N05notifyControlRecommendation</Action>
    <From xmlns="http://www.w3.org/2005/08/addressing">
      <Address>partner:CCN2.Partner.EU.Customs.TAXUD/ICS_CR</Address>
    </From>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>partner:CCN2.Partner.EU.Customs.TAXUD/ICS_CR</Address>
    </ReplyTo>
    <FaultTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>partner:CCN2.Partner.EU.Customs.TAXUD/ICS_CR</Address>
    </FaultTo>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">89d46393ebe1-486b-9f76-756b07ef995c</MessageID>
    <ccnm:MessageHeader xmlns:ccnm="http://ccn2.ec.eu/CCN2.Service.Platform.Common.Schema">
      <ccnm:Version>1.0</ccnm:Version>
      <ccnm:SendingDateAndTime>2020-08-17T09:42:10.496Z</ccnm:SendingDateAndTime>
      <ccnm:MessageType>CCN2.Service.Customs.EU.ICS.NESControlBAS/IE4N05notifyControlRecommendation</ccnm:MessageType>
      <ccnm:RequestCoD>true</ccnm:RequestCoD>
    </ccnm:MessageHeader>
    <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXehACZ3ZWJsb2dpYy5kaWFnbm9zdGljcy5EaWFnbm9zdGljQ29udGV4dAAAAX8AAAAyd2VibG9naWMuZGlhZ25vc3RpY3MuY29udGV4dC5EaWFnbm9zdGljQ29udGV4dEltcGwAAAAwfGZlNzViYTEzLWQ0NTktNDE4NC05NmIxLThhYjExMWUxOGIzNS0wMDAyMjc5YXx8AAAAAgAAAAAAAAA=</work:WorkContext>
    <wsse:Security xmlns:soapEnvelope="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapEnvelope:mustUnderstand="1" soapEnvelope:role="CCN2.Platform">
      <ns1:UsernameToken xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns4="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ns4:Id="UsernameToken-a15e2483-1b89-43c1-8057-06c72ef987f1">
        <ns1:Username>@username@</ns1:Username>
        <ns1:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">@password@</ns1:Password>
      </ns1:UsernameToken>
    </wsse:Security>
  </S:Header>
  <S:Body>
    <ns1:IE4N05notifyControlRecommendationReqMsg xmlns="urn:wco:datamodel:WCO:CIS:1" xmlns:ns1="http://xmlns.ec.eu/BusinessActivityService/ICS/INESControlBAS/V1">
      <IE4N05>
        <MessageHeader>
          <messageId>89d46393ebe1-486b-9f76-756b07ef995c</messageId>
          <correlationId>be66c38d49d8-4cff-993b-1903a9abdcd6</correlationId>
          <replyToMessageId>2227a5794feb-4456-938e-318f7f43433a</replyToMessageId>
          <messageTimestamp>2020-08-17T09:42:10Z</messageTimestamp>
          <messageSender>CR</messageSender>
          <messageRecipient>NES.BE</messageRecipient>
        </MessageHeader>
        <messageFunction>9</messageFunction>
        <functionalReference>1435c08b614be7144bfad34fdd1c10b5049</functionalReference>
        <documentIssueDate>
          <DateTime>2020-08-17T09:42:10Z</DateTime>
        </documentIssueDate>
        <memberStateOfControl>
          <country>BE</country>
        </memberStateOfControl>
        <responsibleMemberState>
          <country>BE</country>
        </responsibleMemberState>
        <riskAnalysis>
          <riskAnalysisRequestReference>14316b47c3bbd964703b76a041b961e1daa</riskAnalysisRequestReference>
          <category>F</category>
          <riskAnalysisResult>
            <riskAnalysisType>Z</riskAnalysisType>
            <riskAreaCode>1006000</riskAreaCode>
            <riskLevel>12</riskLevel>
            <riskCriteriaIdentifier>32</riskCriteriaIdentifier>
            <resultCode>1</resultCode>
            <resultText>51CE9552D7</resultText>
            <dateAndTimeOfCompletion>
              <DateTime>2020-08-17T09:42:09Z</DateTime>
            </dateAndTimeOfCompletion>
            <pointer>
              <messageElementPath>0B5323CBA7</messageElementPath>
            </pointer>
          </riskAnalysisResult>
          <riskAnalysisResult>
            <riskAnalysisType>Z</riskAnalysisType>
            <riskAreaCode>1006000</riskAreaCode>
            <riskLevel>12</riskLevel>
            <riskCriteriaIdentifier>32</riskCriteriaIdentifier>
            <resultCode>1</resultCode>
            <resultText>51CE9552D7</resultText>
            <dateAndTimeOfCompletion>
              <DateTime>2020-08-17T09:42:09Z</DateTime>
            </dateAndTimeOfCompletion>
            <pointer>
              <messageElementPath>0B5323CBA7</messageElementPath>
            </pointer>
          </riskAnalysisResult>
          <riskAnalysisResult>
            <riskAnalysisType>E</riskAnalysisType>
            <riskAreaCode>1006000</riskAreaCode>
            <riskLevel>12</riskLevel>
            <riskCriteriaIdentifier>32</riskCriteriaIdentifier>
            <resultCode>1</resultCode>
            <resultText>51CE9552D7</resultText>
            <dateAndTimeOfCompletion>
              <DateTime>2020-08-17T09:42:09Z</DateTime>
            </dateAndTimeOfCompletion>
            <pointer>
              <messageElementPath>0B5323CBA7</messageElementPath>
            </pointer>
          </riskAnalysisResult>
        </riskAnalysis>
        <controlRecommendations>
          <controlSubject>
            <consignmentMasterLevel>
              <consignmentHouseLevel>
                <sequenceNumber>1</sequenceNumber>
                <goodsItem>
                  <goodsItemNumber>70350</goodsItemNumber>
                  <passiveBorderTransportMeans>
                    <identificationNumber>D</identificationNumber>
                    <typeOfIdentification>31</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <passiveBorderTransportMeans>
                    <identificationNumber>KAULKQSE2DGLA054FYR8</identificationNumber>
                    <typeOfIdentification>31</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <transportEquipment>
                    <containerIdentificationNumber>BU97HO</containerIdentificationNumber>
                  </transportEquipment>
                  <transportEquipment>
                    <containerIdentificationNumber>A3BLL5F22T</containerIdentificationNumber>
                  </transportEquipment>
                </goodsItem>
                <passiveBorderTransportMeans>
                  <identificationNumber>Q179374VM4X9CONCS5A3</identificationNumber>
                  <typeOfIdentification>21</typeOfIdentification>
                </passiveBorderTransportMeans>
                <transportDocumentHouseLevel>
                  <documentNumber>WSE3N3AA4WK8O4AMLSZ5QG6QOA8BQZH7O0LOHJ1OYS58AG309RY2</documentNumber>
                  <type>C664</type>
                </transportDocumentHouseLevel>
                <transportEquipment>
                  <containerIdentificationNumber>QOT</containerIdentificationNumber>
                </transportEquipment>
                <transportEquipment>
                  <containerIdentificationNumber>97ZLZ</containerIdentificationNumber>
                </transportEquipment>
              </consignmentHouseLevel>
            </consignmentMasterLevel>
          </controlSubject>
        </controlRecommendations>
        <controlRecommendations>
          <controlSubject>
            <consignmentMasterLevel>
              <consignmentHouseLevel>
                <sequenceNumber>2</sequenceNumber>
                <goodsItem>
                  <goodsItemNumber>37949</goodsItemNumber>
                  <passiveBorderTransportMeans>
                    <identificationNumber>S971B2WHT63MXIYY9O</identificationNumber>
                    <typeOfIdentification>80</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <passiveBorderTransportMeans>
                    <identificationNumber>0UEMQNZ5LXBHWM9R71EE0T55</identificationNumber>
                    <typeOfIdentification>10</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <transportEquipment>
                    <containerIdentificationNumber>HVZ5YG9RQ9UEAV01</containerIdentificationNumber>
                  </transportEquipment>
                </goodsItem>
                <goodsItem>
                  <goodsItemNumber>80634</goodsItemNumber>
                  <packaging>
                    <shippingMarks>2EHG21IOR4EQAGQ8V0ZPRCBMONGHBFZW8O93C88EHY6J4LH73T19H725OG35WJVWK2V282FBDHCQQM8YQJR7CP58INSJPC9H7NHAAU0YRGXUGNBH6GRJ2QRGF6YC7FR1T7WFVBZFBKJ2L18WX3ERNT7C9IGR3T9XD75Y4N7GINSBPDBPC8WV8Q8X4JYR9C3UNKHDEP3RH2K61RUYY05QSKDXZBC6WC6HFP0990CWVEFXBU7KQMSSCAYBXSEFWYOCAH911DWN6MBIBDYUDWREQ7E5H2KFKGL5QXYB3T3H6A3Y9LR3BO9GH6D0TL6JG4JQBHRN883UO0XBTHREIEN6OLUTZZF7X5Y3U</shippingMarks>
                    <typeOfPackages>TR</typeOfPackages>
                  </packaging>
                  <passiveBorderTransportMeans>
                    <identificationNumber>0XR9NWWGA1DTOYIH7WLGKYQBQTAEK67GB</identificationNumber>
                    <typeOfIdentification>21</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <passiveBorderTransportMeans>
                    <identificationNumber>7UPMBXRNRZ1</identificationNumber>
                    <typeOfIdentification>20</typeOfIdentification>
                  </passiveBorderTransportMeans>
                  <transportEquipment>
                    <containerIdentificationNumber>EABZ7MBC4DE</containerIdentificationNumber>
                  </transportEquipment>
                  <transportEquipment>
                    <containerIdentificationNumber>XYB</containerIdentificationNumber>
                  </transportEquipment>
                </goodsItem>
                <passiveBorderTransportMeans>
                  <identificationNumber>UHJ96G2FG09A761RUJNP6ROPP2UD9XH</identificationNumber>
                  <typeOfIdentification>31</typeOfIdentification>
                </passiveBorderTransportMeans>
                <transportDocumentHouseLevel>
                  <documentNumber>0U2RNO4Q0NWNTJ0V2LEX6GRDOH42QMASKEKOFZPXX3NT611257A</documentNumber>
                  <type>C665</type>
                </transportDocumentHouseLevel>
                <transportEquipment>
                  <containerIdentificationNumber>QQ796ILYW2O1</containerIdentificationNumber>
                </transportEquipment>
              </consignmentHouseLevel>
            </consignmentMasterLevel>
          </controlSubject>
        </controlRecommendations>
      </IE4N05>
    </ns1:IE4N05notifyControlRecommendationReqMsg>
  </S:Body>
</S:Envelope>